IT_MOL/src/Documents/Поступление/Поступление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поступление</name>
  <registerRecords>InformationRegister.СерийныйНомер</registerRecords>
  <registerRecords>AccumulationRegister.ОстатокМЦ</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчёта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМЦ</name>
    <attributes>
      <name>МодельОборудования</name>
      <type>
        <types>CatalogRef.МодельОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IT_MOL/src/AccumulationRegisters/ОстатокМЦ/ОстатокМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстатокМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МодельОборудования</name>
    <type>
      <types>CatalogRef.МодельОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IT_MOL/src/InformationRegisters/СерийныйНомер/СерийныйНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СерийныйНомер</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>МодельОборудования</name>
    <type>
      <types>CatalogRef.МодельОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IT_MOL/src/Documents/Поступление/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстатокМЦ Приход
	Движения.ОстатокМЦ.Записывать = Истина;
	Движения.СерийныйНомер.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокМЦ Из СписокМЦ Цикл
		Движение = Движения.ОстатокМЦ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.МодельОборудования = ТекСтрокаСписокМЦ.МодельОборудования;
		Движение.Ответственный = Ответственный;
		Движение.Количество = ТекСтрокаСписокМЦ.Количество;
		
		// Информация
		
		Если ТекСтрокаСписокМЦ.Количество = 1 И ЗначениеЗаполнено(ТекСтрокаСписокМЦ.СерийныйНомер) Тогда
			Информация = Движения.СерийныйНомер.Добавить();
			Информация.Период = Дата;
			Информация.МодельОборудования = ТекСтрокаСписокМЦ.МодельОборудования;
			Информация.Ответственный = Ответственный;
			Информация.СерийныйНомер = ТекСтрокаСписокМЦ.СерийныйНомер;
		КонецЕсли
		
	КонецЦикла;
КонецПроцедуры
